app/controllers/movies_controller.rb

INSERT INTO "movies" ("title", "rating", "description", "release_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def add_tmdb
    if(params['checked_movie_ids'].nil?)
      flash[:notice] = "No movies selected"
      redirect_to movies_path
    else
      params['checked_movie_ids'].each do |id|
        Movie.create_from_tmdb(id)

SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13', 'NC-17', 'R')
---
  def index
    sort = params[:sort] || session[:sort]
    case sort
    when 'title'
      ordering,@title_header = {:title => :asc}, 'hilite'
    when 'release_date'
      ordering,@date_header = {:release_date => :asc}, 'hilite'
    end
    @all_ratings = Movie.all_ratings
    @selected_ratings = params[:ratings] || session[:ratings] || {}

    if @selected_ratings == {}
      @selected_ratings = Hash[@all_ratings.map {|rating| [rating, rating]}]

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "movies" SET "rating" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["rating", "R"], ["updated_at", "2015-10-06 19:21:56.871995"], ["id", 1]]
---
  def update
    @movie = Movie.find params[:id]
    @movie.update_attributes!(movie_params)